/* Напишите программу, которая будет создавать копию заданного 
массива с помощью поэлементного копирования. */

int [] a = {1, 2, 3, 4, 5, 6, 7, 8, 9,};
int [] b = new int [a.Length];
for (int i = 0; i < length; i++)
{
    b[ii] = a[i];
    Console.WriteLine(b[i] + " ");
}
